package by.it.akhmelev.lesson03;

public class TaskA2 {
/*
напишите программу которая выводит на экран 5 строк
Я начинаю изучать Java!

Для ручной проверки запустите программу Ctrl+Shift+F10
Для автоматической проверки откройте и запустите класс Testing
*/
    public static void main(String[] args) {
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
        System.out.println("Я начинаю изучать Java!");
    }
}
