package by.it.sc04_evening_tue_thu.popruga.lesson03;

class TaskA1 {
    /*
    напишите программу которая выводит на экран
    Hello world!

    (строка должа быть одна, ошибки в тексте не допускаются)
    Для ручной проверки запустите программу Ctrl+Shift+F10
    Для автоматической проверки откройте и запустите класс Testing
    */
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
